###############################################################################
# Created by write_sdc
###############################################################################
current_design asic_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 20.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_type[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_type[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_valid}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_valid}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[0]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[10]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[11]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[12]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[13]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[14]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[15]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[16]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[17]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[18]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[19]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[1]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[20]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[21]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[22]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[23]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[24]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[25]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[26]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[27]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[28]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[29]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[2]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[30]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[31]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[3]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[4]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[5]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[6]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[7]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[8]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_word[9]}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_ready}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_ready}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {start}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {use_streamed_counter}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {use_streamed_key}]
set_input_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {use_streamed_nonce}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {busy}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_index[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_index[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_index[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_index[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_index[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {chunk_request}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {done}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {in_state_ready}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_valid}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_key_word[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_valid}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[10]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[11]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[12]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[13]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[14]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[15]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[16]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[17]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[18]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[19]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[1]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[20]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[21]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[22]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[23]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[24]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[25]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[26]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[27]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[28]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[29]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[2]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[30]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[31]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[3]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[4]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[5]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[6]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[7]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[8]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_state_word[9]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {request_type[0]}]
set_output_delay 4.0000 -clock [get_clocks {clk}] -add_delay [get_ports {request_type[1]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {busy}]
set_load -pin_load 0.0334 [get_ports {chunk_request}]
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {in_state_ready}]
set_load -pin_load 0.0334 [get_ports {out_key_valid}]
set_load -pin_load 0.0334 [get_ports {out_state_valid}]
set_load -pin_load 0.0334 [get_ports {chunk_index[4]}]
set_load -pin_load 0.0334 [get_ports {chunk_index[3]}]
set_load -pin_load 0.0334 [get_ports {chunk_index[2]}]
set_load -pin_load 0.0334 [get_ports {chunk_index[1]}]
set_load -pin_load 0.0334 [get_ports {chunk_index[0]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[31]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[30]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[29]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[28]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[27]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[26]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[25]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[24]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[23]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[22]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[21]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[20]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[19]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[18]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[17]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[16]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[15]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[14]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[13]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[12]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[11]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[10]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[9]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[8]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[7]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[6]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[5]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[4]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[3]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[2]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[1]}]
set_load -pin_load 0.0334 [get_ports {out_key_word[0]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[31]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[30]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[29]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[28]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[27]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[26]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[25]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[24]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[23]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[22]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[21]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[20]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[19]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[18]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[17]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[16]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[15]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[14]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[13]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[12]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[11]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[10]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[9]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[8]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[7]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[6]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[5]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[4]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[3]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[2]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[1]}]
set_load -pin_load 0.0334 [get_ports {out_state_word[0]}]
set_load -pin_load 0.0334 [get_ports {request_type[1]}]
set_load -pin_load 0.0334 [get_ports {request_type[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {out_key_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {out_state_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {start}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {use_streamed_counter}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {use_streamed_key}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {use_streamed_nonce}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk_type[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {chunk_type[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in_state_word[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
